#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.service.fastly_service_v1.service: Refreshing state... [id=6npP563Yf84ss5W37m5rSf]
module.cert.fastly_tls_subscription.subscription: Refreshing state... [id=KkDtk7KQw7dHMH3EI4yjTA]
module.cert.aws_route53_record.domain_validation: Refreshing state... [id=Z09746811FRPQHUTQ7HK2__acme-challenge.stage.hkakehas.tokyo_CNAME]
module.cert.fastly_tls_subscription_validation.validation: Refreshing state... [id=KkDtk7KQw7dHMH3EI4yjTA]
module.cert.aws_route53_record.record: Refreshing state... [id=Z09746811FRPQHUTQ7HK2_stage.hkakehas.tokyo_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.service.fastly_service_v1.service will be updated in-place
  ~ resource "fastly_service_v1" "service" {
      ~ active_version     = 2 -> (known after apply)
      ~ cloned_version     = 2 -> (known after apply)
        id                 = "6npP563Yf84ss5W37m5rSf"
        name               = "stage.hkakehas.tokyo"
        # (6 unchanged attributes hidden)

      + acl {
          + acl_id        = (known after apply)
          + force_destroy = true
          + name          = "allow_list"
        }



      + snippet {
          + content  = <<-EOT
                if (req.backend.is_origin) { 
                  declare local var.result STRING; 
                  // Look for first dir and use it as a Surrogate Key.
                  set var.result = if(req.url.path ~ "^/([^/]+)/", re.group.1, "");
                
                  if (std.strlen(var.result) > 0) {
                    set beresp.http.Surrogate-Key = var.result;
                  }
                }
            EOT
          + name     = "fetch_skey"
          + priority = 100
          + type     = "fetch"
        }
      - snippet {
          - content  = <<-EOT
                if (req.backend.is_origin) { 
                  declare local var.result STRING; 
                  set var.result = if(req.url.path ~ "^/([^/]+)/", re.group.1, "");
                
                  if (std.strlen(var.result) > 0) {
                    set beresp.http.Surrogate-Key = var.result;
                  }
                }
            EOT -> null
          - name     = "fetch_skey" -> null
          - priority = 100 -> null
          - type     = "fetch" -> null
        }
      + snippet {
          + content  = <<-EOT
                if(fastly.ff.visits_this_service == 0 && req.http.Fastly-Client-IP !~ allow_list) {
                    error 403 "Forbidden";
                }
            EOT
          + name     = "recv_acl"
          + priority = 90
          + type     = "recv"
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ service = {
      ~ active_version = 2 -> (known after apply)
      ~ cloned_version = 2 -> (known after apply)
        # (2 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @hrmsk66, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*